IdeaRS.OpenModel.Concrete.CheckResult.TypeSLSLimitStressCheck
Type of SLS check in extreme result

IdeaRS.OpenModel.Concrete.CheckResult.TypeSLSLimitStressCheck.notSet
not set value

IdeaRS.OpenModel.Concrete.CheckResult.TypeSLSLimitStressCheck.Check_7_2_2_Concrete_fck
check 7.2 (2) is used

IdeaRS.OpenModel.Concrete.CheckResult.TypeSLSLimitStressCheck.Check_7_2_3_Concrete_fck
check 7.2 (3) is used

IdeaRS.OpenModel.Concrete.CheckResult.TypeSLSLimitStressCheck.Check_7_2_5_Tendons_fpk
check 7.2 (5) stress in reinforcement bars is used

IdeaRS.OpenModel.Concrete.CheckResult.TypeSLSLimitStressCheck.Check_7_2_5_ReinforcementBars_fyk
check 7.2 (5) stress in tendons is used

IdeaRS.OpenModel.Concrete.CheckResult.TypeSLSLimitStressCheck.Check_5_10_3_2_Tendons
check 5.10.3 (2) stress in tendons is used

IdeaRS.OpenModel.Concrete.CheckResult.TypeSLSLimitStressCheck.Check_5_10_2_1_1_Tendons
check 5.10.2.1 (1) stress in tendons is used